[
{"name": "Ravissant T3 Neuf Climatisé - Centre ville", "url": "https://www.booking.com/hotel/fr/ravissant-t3-neuf-climatise-centre-ville.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=6&hapos=6&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": null, "address": "23 Rue du Plan de l'Olivier, 34000 Montpellier, France", "description": "In the heart of Montpellier, set within a short distance of The Corum and Fabre Museum, Ravissant T3 Neuf Climatisé - Centre ville offers free WiFi, air conditioning and household amenities such as a microwave and coffee machine. Guests staying at this apartment have access to a balcony. The property is non-smoking and is situated 700 metres from Place de la Comédie.\n\nThis apartment is fitted with 1 bedroom, a kitchen with a dishwasher and an oven, a flat-screen TV, a seating area and 1 bathroom fitted with a shower. Towels and bed linen are offered in the apartment. For added privacy, the accommodation features a private entrance.\n\nMontpellier Town Hall is 3 km from the apartment, while Montpellier Cathedral of Saint Peter is 400 metres from the property. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Ravissant T3 Neuf Climatisé - Centre ville.", "latitude": 43.6132661, "longitude": 3.8783153},
{"name": "Jacques III d'aragon", "url": "https://www.booking.com/hotel/fr/jacques-iii-d-aragon.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=10&hapos=10&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.4", "address": "10 Rue de l'Argenterie, 34000 Montpellier, France", "description": "Offering inner courtyard views, Jacques III d'aragon is an accommodation located in Montpellier, 700 metres from The Corum and 500 metres from Fabre Museum. It is set 400 metres from Place de la Comédie and offers luggage storage space. The property is 100 metres from the city centre and 600 metres from Montpellier Cathedral of Saint Peter.\n\nWith free WiFi, this 1-bedroom apartment provides a cable flat-screen TV and a kitchenette with an oven and microwave. Towels and bed linen are provided in the apartment. For added privacy, the accommodation features a private entrance.\n\nMontpellier Town Hall is 5.5 km from the apartment, while Agrolpolis International is 5.9 km away. The nearest airport is Montpellier - Mediterranee Airport, 11 km from Jacques III d'aragon.", "latitude": 43.60925165, "longitude": 3.8776916},
{"name": "Les 4 étoiles", "url": "https://www.booking.com/hotel/fr/les-4-etoiles.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=11&hapos=11&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from_sustainable_property_sr=1&from=searchresults", "rating": "9.9", "address": "3 Rue Delmas, 34000 Montpellier, France", "description": "Set in Montpellier, 1.2 km from Place de la Comédie, les 4 etoiles features air-conditioned rooms and private parking.\n\nYou will find a coffee machine in the room. Each room is fitted with a private bathroom. Les 4 etoiles features free WiFi throughout the property.\n\nThere is a shared kitchen at the property.\n\nZenith Sud Montpellier is 4.4 km from les 4 etoiles, while Promenade du Peyrou is 500 metres away. The nearest airport is Montpellier - Mediterranee Airport, 8 km from les 4 etoiles.", "latitude": 43.61042273, "longitude": 3.86381006},
{"name": "Artistic Loft, Downtown Montpellier, WIFI", "url": "https://www.booking.com/hotel/fr/artistic-loft-downtown-montpellier-wifi.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=7&hapos=7&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.2", "address": "8 Rue Guillaume Pellicier, 34070 Montpellier, France", "description": "Right in the centre of Montpellier, situated within a short distance of Montpellier National Opera and Montpellier Cathedral of Saint Peter, Artistic Loft, Downtown Montpellier, WIFI offers free WiFi, air conditioning and household amenities such as a toaster and coffee machine. This apartment features accommodation with a patio. The property is non-smoking and is set 1.4 km from Place de la Comédie.\n\nThe spacious apartment with a terrace and garden views has 1 bedroom, a living room, a flat-screen TV, an equipped kitchen with an oven and a microwave, and 1 bathroom with a walk-in shower. Towels and bed linen are available in the apartment. There is also a seating area and a fireplace.\n\nGuests can relax in the garden at the property.\n\nThe Corum is 1.7 km from the apartment, while Fabre Museum is 1.5 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Artistic Loft, Downtown Montpellier, WIFI.", "latitude": 43.6083263, "longitude": 3.8668426},
{"name": "le balcon de Saint Roch", "url": "https://www.booking.com/hotel/fr/roucher.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=8&hapos=8&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "8.5", "address": "32 Rue Roucher, 34000 Montpellier, France", "description": "Right in the centre of Montpellier, situated within a short distance of Montpellier National Opera and Place de la Comédie, le balcon de Saint Roch offers free WiFi, air conditioning and household amenities such as an oven and coffee machine. Boasting free shuttle service, this property also provides guests with a sun terrace. The property is non-smoking and is set 700 metres from Montpellier Cathedral of Saint Peter.\n\nThe apartment has 1 bedroom, 1 bathroom, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchen, and a balcony with city views. For added privacy, the accommodation has a private entrance and soundproofing.\n\nMontpellier Town Hall is 2.6 km from the apartment, while The Corum is 1 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 9 km from le balcon de Saint Roch.", "latitude": 43.60798576, "longitude": 3.87482351},
{"name": "Hotel d'Aragon", "url": "https://www.booking.com/hotel/fr/hotel-daragon.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=1&hapos=1&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from_sustainable_property_sr=1&from=searchresults", "rating": "8.6", "address": "10 rue Baudin, 34000 Montpellier, France", "description": "Situé au cœur de Montpellier, l'hôtel d'Aragon offre un cadre élégant et une situation privilégiée pour découvrir le patrimoine artistique, culturel et historique de la ville.\n\nLes chambres personnalisées de l'hôtel d'Aragon sont spacieuses, insonorisées et équipées d'une télévision à écran plat ( chromecast ), d'un accès Internet gratuit, pour certaines, de douches hydrojets, minibar, machine à café et d'une baignoire balnéo.\n\nPour le délicieux petit déjeuner nous privilégions des produits de qualités, des produits bio de préférence, sous forme de buffet qui est servi tous les jours dans la véranda au toit de verre, il devient un salon confortable baigné de lumière naturelle l'après midi pour un petit moment de convivialité.\n\nL'Hôtel d'Aragon bénéficie d'une situation privilégiée à 500 mètres de la gare TGV Saint Roch, à proximité de la place de la Comédie, de l'Opéra et du centre de conférences Corum.", "latitude": 43.60835743, "longitude": 3.88187259},
{"name": "Suite indépendante avec 1 chambre et 1 bureau", "url": "https://www.booking.com/hotel/fr/suite-independante-avec-1-chambre-et-1-bueau.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=5&hapos=5&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.6", "address": "17 Rue Desmazes, 34000 Montpellier, France", "description": "Located 1.1 km from Montpellier National Opera and 1.4 km from Place de la Comédie in the centre of Montpellier, Suite indépendante avec 1 chambre et 1 bureau provides accommodation with free WiFi and free private parking. With garden views, this accommodation features a terrace. The property is non-smoking and is situated 1.3 km from Montpellier Cathedral of Saint Peter.\n\nTowels and bed linen are provided in the bed and breakfast.\n\nGuests can also relax in the garden.\n\nGGL Stadium is 2.9 km from the bed and breakfast, while Montpellier Town Hall is 3.2 km away. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Suite indépendante avec 1 chambre et 1 bureau.", "latitude": 43.6050372, "longitude": 3.8682942},
{"name": "Studio coeur de ville et au calme (1)", "url": "https://www.booking.com/hotel/fr/studio-coeur-de-ville-et-au-calme-1-montpellier.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=9&hapos=9&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "8.3", "address": "7 Rue du Général Claparède, 34000 Montpellier, France", "description": "Set in the centre of Montpellier, just 800 metres from Montpellier National Opera and 1.1 km from Place de la Comédie, Studio coeur de ville et au calme (1) offers accommodation with quiet street views and free WiFi. The property is around 2.9 km from Montpellier Town Hall, 1.4 km from The Corum and 1.1 km from Fabre Museum. The property is non-smoking and is located less than 1 km from Montpellier Cathedral of Saint Peter.\n\nThe apartment has 1 bedroom, a flat-screen TV, a fully equipped kitchenette with a microwave and a toaster, and 1 bathroom with a shower. Towels and bed linen are offered in the apartment. For added privacy, the accommodation features a private entrance.\n\nGGL Stadium is 3.6 km from the apartment, while Odysseum Shopping Centre is 5.2 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Studio coeur de ville et au calme (1).", "latitude": 43.6079857, "longitude": 3.8701237},
{"name": "Le temps d'un passage", "url": "https://www.booking.com/hotel/fr/le-temps-d-un-passage-montpellier.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=4&hapos=4&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.0", "address": "3 Passage Bruyas, 34000 Montpellier, France", "description": "In the heart of Montpellier, set within a short distance of Place de la Comédie and The Corum, Le temps d'un passage offers free WiFi, air conditioning and household amenities such as a dishwasher and coffee machine. Guests staying at this apartment have access to a patio. The property is non-smoking and is situated 2.2 km from Montpellier Town Hall.\n\nThe apartment is fitted with 1 bedroom, 1 bathroom, bed linen, towels, a flat-screen TV, a dining area, a fully equipped kitchen, and a balcony with city views. The unit at the property features a bath and a dressing room. For added privacy, the accommodation features a private entrance.\n\nPopular points of interest near the apartment include Fabre Museum, Montpellier National Opera and Montpellier Cathedral of Saint Peter. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Le temps d'un passage.", "latitude": 43.6093775, "longitude": 3.8795106},
{"name": "Au cœur de M", "url": "https://www.booking.com/hotel/fr/au-coeur-de-m.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=3&hapos=3&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.8", "address": "8 Rue Baudin, 34000 Montpellier, France", "description": "Well located in the centre of Montpellier, Au cœur de M offers a balcony, air conditioning, free WiFi and flat-screen TV. The property features city views and is 400 metres from Montpellier National Opera and 700 metres from The Corum. The property is non-smoking and is located 2 km from Montpellier Town Hall.\n\nTowels and bed linen are provided in the bed and breakfast. For added privacy, the accommodation has a private entrance and soundproofing.\n\nA continental breakfast is available daily at the bed and breakfast. There is a coffee shop on-site.\n\nPopular points of interest near Au cœur de M include Fabre Museum, Place de la Comédie and Montpellier Cathedral of Saint Peter. The nearest airport is Montpellier - Mediterranee Airport, 9 km from the accommodation.", "latitude": 43.6083725, "longitude": 3.8817453},
{"name": "Eklo Montpellier Centre Gare", "url": "https://www.booking.com/hotel/fr/eklo-montepellier-centre-gare.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=20&hapos=20&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from_sustainable_property_sr=1&from=searchresults", "rating": "8.3", "address": "4 Rue Jules Ferry, 34000 Montpellier, France", "description": "Ideally located in the centre of Montpellier, Eklo Montpellier Centre Gare offers air-conditioned rooms, a garden, free WiFi and a shared lounge. Boasting a 24-hour front desk, this property also welcomes guests with a restaurant and a terrace. Private parking is available on site.\n\nAt the hotel, the rooms are equipped with a wardrobe. All guest rooms feature a private bathroom, free toiletries and bed linen.\n\nA buffet breakfast is available every morning at Eklo Montpellier Centre Gare.\n\nPopular points of interest near the accommodation include Montpellier Town Hall, Montpellier National Opera and Place de la Comédie. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Eklo Montpellier Centre Gare.", "latitude": 43.60572, "longitude": 3.88134},
{"name": "Studio St Ursule R2", "url": "https://www.booking.com/hotel/fr/appartement-st-ursule-2eme-etages.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=17&hapos=17&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "8.5", "address": "29 Rue Sainte-Ursule, 34000 Montpellier, France", "description": "Set in Montpellier, 500 metres from Fabre Museum and 800 metres from Place de la Comédie, Studio St Ursule R2 provides accommodation with amenities such as free WiFi and a flat-screen TV. The property is located 500 metres from Montpellier Cathedral of Saint Peter, 3.3 km from Montpellier Town Hall and less than 1 km from Montpellier National Opera. The property is 500 metres from the city centre and 600 metres from The Corum.\n\nThe apartment is composed of 1 separate bedroom, a fully equipped kitchen, and 1 bathroom. The accommodation is non-smoking.\n\nAgrolpolis International is 4.4 km from the apartment, while Odysseum Shopping Centre is 4.5 km away. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio St Ursule R2.", "latitude": 43.6140107, "longitude": 3.8779165},
{"name": "Le Broc, Charmant T1 Mezz Centre Ville Corum", "url": "https://www.booking.com/hotel/fr/le-broc-charmant-t1-mezz-centre-ville-corum.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=18&hapos=18&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "10", "address": "2 Rue du Collège Duvergier, 34000 Montpellier, France", "description": "Located in Montpellier, 400 metres from Fabre Museum and 600 metres from Place de la Comédie, Le Broc, Charmant T1 Mezz Centre Ville Corum provides city views and free WiFi. The property is around 3 km from Montpellier Town Hall, 600 metres from Montpellier Cathedral of Saint Peter and 700 metres from Montpellier National Opera. The property is 500 metres from The Corum, and within 400 metres of the city centre.\n\nThis apartment is equipped with 1 bedroom, a kitchen with a microwave and a toaster, a flat-screen TV, a seating area and 1 bathroom. Towels and bed linen are provided in the apartment. The accommodation is non-smoking.\n\nOdysseum Shopping Centre is 4.3 km from the apartment, while Agrolpolis International is 6.6 km away. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Le Broc, Charmant T1 Mezz Centre Ville Corum.", "latitude": 43.6134022, "longitude": 3.8796723},
{"name": "Studio au coeur de Montpellier", "url": "https://www.booking.com/hotel/fr/studio-au-coeur-de-montpellier-montpellier2.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=19&hapos=19&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "7.5", "address": "7 Rue Sainte-Ursule, 34000 Montpellier, France", "description": "Studio au coeur de Montpellier in Montpellier offers accommodation with free WiFi, 400 metres from Fabre Museum, 700 metres from Place de la Comédie and 3 km from Montpellier Town Hall. The property is around 400 metres from Montpellier Cathedral of Saint Peter, 700 metres from Montpellier National Opera and 4.3 km from Odysseum Shopping Centre. The property is 400 metres from the city centre and 600 metres from The Corum.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are featured in the apartment. The accommodation is non-smoking.\n\nGGL Stadium is 6.1 km from the apartment, while Agrolpolis International is 6.6 km away. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio au coeur de Montpellier.", "latitude": 43.61334913, "longitude": 3.87835549},
{"name": "Joli studio centre historique et au calme (2)", "url": "https://www.booking.com/hotel/fr/joli-studio-centre-historique-et-au-calme-2.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=16&hapos=16&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "7.5", "address": "7 Rue du Général Claparède, 34000 Montpellier, France", "description": "Joli studio centre historique et au calme (2) in Montpellier provides accommodation with free WiFi, 1.1 km from Place de la Comédie, less than 1 km from Montpellier Cathedral of Saint Peter and 2.9 km from Montpellier Town Hall. The property is around 1.4 km from The Corum, 1.2 km from Fabre Museum and 3.6 km from GGL Stadium. The property is 800 metres from the city centre and 800 metres from Montpellier National Opera.\n\nThe apartment is equipped with 1 bedroom, 1 bathroom, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchenette, and a balcony with quiet street views. The unit at the property features a shower and a dressing room. For added privacy, the accommodation features a private entrance.\n\nOdysseum Shopping Centre is 5.2 km from the apartment, while Agrolpolis International is 6.9 km away. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Joli studio centre historique et au calme (2).", "latitude": 43.60796822, "longitude": 3.87011029},
{"name": "Appart'City Confort Montpellier Saint Roch", "url": "https://www.booking.com/hotel/fr/appart-city-montpellier.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=2&hapos=2&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from_sustainable_property_sr=1&from=searchresults", "rating": "8.1", "address": "29-31, boulevard Berthelot, 34000 Montpellier, France", "description": "Appart'City Montpellier - Saint Roch is located near Montpellier's historic city centre, a 15-minute walk from Place de la Comédie and Montpellier central train station. It offers air-conditioned apartments and on-site parking. Free WiFi is available in public areas, while cabled Internet is provided in apartments.\n\nApartments at Appart'City Montpellier - Saint Roch have a flat-screen TV with Chromecast and private bathroom. Each apartment also has a fully-equipped kitchenette with a microwave and fridge. All apartments can be accessed by an elevator.\n\nA buffet breakfast is served daily on site. Breakfast is composed of various breads, pastries, fresh and hot beverages. Fresh fruit and fruit salad, as well as cheeses and yogurts are also provided. Additional facilities include a 24-hour reception desk.\n\nThe hotel is conveniently located just 300 metres from Nouveau Saint-Roch tram stop offering a direct transport link to the central station. Montpellier’s Arc de Triomphe is a 20-minute walk from the hotel.", "latitude": 43.59979212, "longitude": 3.87222067},
{"name": "Spacious room in Montpellier City Center", "url": "https://www.booking.com/hotel/fr/spacious-room-in-montpellier-cbd.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=24&hapos=24&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.3", "address": "15 Rue des Sœurs Noires, 34000 Montpellier, France", "description": "Spacious room in Montpellier City Center in Montpellier provides accommodation with free WiFi, less than 1 km from The Corum, a 9-minute walk from Fabre Museum and 700 metres from Place de la Comédie. The property is around 5.5 km from Montpellier Town Hall, 5.9 km from Agrolpolis International and 6.5 km from Montpellier Zoo. The property is 300 metres from the city centre and 700 metres from Montpellier Cathedral of Saint Peter.\n\nTowels and bed linen are featured in the homestay. The accommodation is non-smoking.\n\nMontpellier National Opera is 300 metres from the homestay, while Odysseum Shopping Centre is 6.8 km away. The nearest airport is Montpellier - Mediterranee Airport, 11 km from Spacious room in Montpellier City Center.", "latitude": 43.60895082, "longitude": 3.87513003},
{"name": "Hôtel Royal", "url": "https://www.booking.com/hotel/fr/royalhotel1.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=25&hapos=25&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "8.7", "address": "8, Rue Maguelone, 34000 Montpellier, France", "description": "Renovated in 2021, Hotel Royal is located in the centre of Montpellier, just a 3-minute walk from the Montpellier Train Station and Place de la Comedie. A 24-hour front desk and meeting facilities are featured at the property. Free WiFi access is available throughout.\n\nThe air-conditioned rooms at Hotel Royal are equipped with a telephone, a TV with Canal+ channels, and a private bathroom with a bath or shower. The rooms are accessible by lift.\n\nRoyal serves a buffet breakfast each morning and there are a number of restaurants within a 10-minute walk.\n\nHotel Royal is a 10-minute walk from Le Corum Congress Centre and the Fabre Museum. Guests receive preferential rates at the Comedie car park, which is a 5-minute walk from the hotel. The nearest airport is Mediterranee Airport, 9 km from the property.", "latitude": 43.60669351, "longitude": 3.87975633},
{"name": "Charmant Studio Neuf N•2 - Centre ville", "url": "https://www.booking.com/hotel/fr/charmant-studio-neuf-n-2-centre-ville.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=22&hapos=22&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "7.9", "address": "23 Rue du Plan de l'Olivier, 34000 Montpellier, France", "description": "Situated in Montpellier, 400 metres from Fabre Museum and 700 metres from Place de la Comédie, Charmant Studio Neuf N•2 - Centre ville provides accommodation with amenities such as free WiFi and a flat-screen TV. The property is around 3 km from Montpellier Town Hall, 400 metres from Montpellier Cathedral of Saint Peter and 700 metres from Montpellier National Opera. The property is 600 metres from The Corum, and within 400 metres of the city centre.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are available in the apartment. The accommodation is non-smoking.\n\nOdysseum Shopping Centre is 4.3 km from the apartment, while Agrolpolis International is 6.6 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Charmant Studio Neuf N•2 - Centre ville.", "latitude": 43.6132661, "longitude": 3.8783153},
{"name": "Joli studio avec terrasse-jardin sur les toits, coeur historique", "url": "https://www.booking.com/hotel/fr/joli-studio-avec-terrasse-coeur-historique.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=23&hapos=23&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "8.5", "address": "4 eme etage 7 Rue des Teissiers, 34000 Montpellier, France", "description": "Located in the centre of Montpellier, just 700 metres from Montpellier Cathedral of Saint Peter and less than 1 km from The Corum, Joli studio avec terrasse-jardin sur les toits, coeur historique provides accommodation with city views and free WiFi. Guests staying at this apartment have access to a terrace. Outdoor dining is also possible at the apartment.\n\nThe apartment is equipped with 1 bedroom, a fully equipped kitchen with a microwave and a fridge, and 1 bathroom with a shower and a hair dryer. Towels and bed linen are provided in the apartment. This apartment is non-smoking and soundproof.\n\nPopular points of interest near Joli studio avec terrasse-jardin sur les toits, coeur historique include Fabre Museum, Place de la Comédie and Montpellier National Opera. The nearest airport is Montpellier - Mediterranee Airport, 11 km from the accommodation.", "latitude": 43.6086149, "longitude": 3.8755841},
{"name": "Studio à 5 mn à pied de la gare Saint-Roch", "url": "https://www.booking.com/hotel/fr/studio-a-5-mn-a-pied-de-la-gare-saint-roch.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=21&hapos=21&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "7.6", "address": "29 Rue des Aiguerelles, 34000 Montpellier, France", "description": "Located in the centre of Montpellier, 1.5 km from Montpellier Town Hall, Studio à 5 mn à pied de la gare Saint-Roch provides air-conditioned accommodation with free WiFi and a flat-screen TV. The property is around 3.6 km from Odysseum Shopping Centre, 1.6 km from Montpellier Cathedral of Saint Peter and 4.3 km from GGL Stadium. The property is non-smoking and is situated less than 1 km from Montpellier National Opera.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are provided in the apartment.\n\nPopular points of interest near the apartment include Place de la Comédie, The Corum and Fabre Museum. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio à 5 mn à pied de la gare Saint-Roch.", "latitude": 43.6022125, "longitude": 3.8842535},
{"name": "21 Centre Historique - Gare- Place de la Comédie", "url": "https://www.booking.com/hotel/fr/21-centre-historique-gare-place-de-la-comedie.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=13&hapos=13&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "8.6", "address": "Appartement 21 - 2eme étage 22 Rue Aristide Ollivier, 34000 Montpellier, France", "description": "In the centre of Montpellier, located within a short distance of Montpellier Town Hall and Montpellier National Opera, 21 Centre Historique - Gare- Place de la Comédie offers free WiFi, air conditioning and household amenities such as a microwave and coffee machine. The property features inner courtyard views and is less than 1 km from The Corum and a 8-minute walk from Fabre Museum. Place de la Comédie is 500 metres away and Odysseum Shopping Centre is 4 km from the apartment.\n\nThe recently renovated apartment is equipped with 1 separate bedroom, 1 bathroom, a fully equipped kitchen with a dining area and oven, and a living room with a flat-screen TV. Towels and bed linen are provided in the apartment. This apartment is non-smoking and soundproof.\n\nMontpellier Cathedral of Saint Peter is 1.1 km from the apartment, while GGL Stadium is 4.7 km away. The nearest airport is Montpellier - Mediterranee Airport, 8 km from 21 Centre Historique - Gare- Place de la Comédie.", "latitude": 43.6064202, "longitude": 3.8823168},
{"name": "Charmant et lumineux appartement", "url": "https://www.booking.com/hotel/fr/charmant-et-lumineux-appartement.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=15&hapos=15&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.2", "address": "29 Rue Chaptal, 34000 Montpellier, France", "description": "In a central area of Montpellier, located within a short distance of Montpellier Cathedral of Saint Peter and Montpellier National Opera, Charmant et lumineux appartement offers free WiFi, air conditioning and household amenities such as a fridge and coffee machine. This recently renovated apartment is located 1.3 km from Place de la Comédie and 3.3 km from GGL Stadium. The property is non-smoking and is set 3.4 km from Montpellier Town Hall.\n\nThis apartment comes with 1 bedroom, a kitchen with a microwave and a toaster, a flat-screen TV, a seating area and 1 bathroom equipped with a shower. Towels and bed linen are featured in the apartment. For added privacy, the accommodation features a private entrance.\n\nThe Corum is 1.7 km from the apartment, while Fabre Museum is 1.4 km away. The nearest airport is Montpellier - Mediterranee Airport, 12 km from Charmant et lumineux appartement.", "latitude": 43.6047085, "longitude": 3.8697061},
{"name": "Studio sous les toits très bien placé et climatisé", "url": "https://www.booking.com/hotel/fr/studio-sous-les-toits-tres-bien-place-et-climatise.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=14&hapos=14&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "9.0", "address": "1 Impasse Copé Cambes, 34000 Montpellier, France", "description": "Set in the centre of Montpellier, 200 metres from Montpellier National Opera and 500 metres from Place de la Comédie, Studio sous les toits très bien placé et climatisé offers free WiFi and air conditioning. The property is situated 4.4 km from Odysseum Shopping Centre, 4.6 km from GGL Stadium and 7.5 km from Agrolpolis International. The property is non-smoking and is located 2.4 km from Montpellier Town Hall.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are offered in the apartment.\n\nThere is a coffee shop on-site.\n\nPopular points of interest near the apartment include The Corum, Fabre Museum and Montpellier Cathedral of Saint Peter. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio sous les toits très bien placé et climatisé.", "latitude": 43.6078264, "longitude": 3.8766466},
{"name": "OVELIA Montpellier - Les Balcons de Montcalm", "url": "https://www.booking.com/hotel/fr/ovelia-montpellier-les-balcons-de-montcalm.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gC06fGswbAAgHSAiQwZTY2MmM1Ny0wZjAwLTRiMTMtODM3YS1mMmMzOGFmOWY1NDnYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=12&hapos=12&sr_order=popularity&srpvid=76b662e91f8900d6&srepoch=1718719444&from=searchresults", "rating": "8.7", "address": "18 Rue de Claret, 34070 Montpellier, France", "description": "OVELIA Montpellier - Les Balcons de Montcalm is situated in Montpellier, 1.5 km from Montpellier National Opera, 1.6 km from Montpellier Cathedral of Saint Peter, and 1.9 km from Place de la Comédie. The property is located 2.9 km from GGL Stadium, 3.3 km from Montpellier Town Hall and 3.6 km from The Corum. Private parking can be arranged at an extra charge.\n\nFeaturing a private bathroom, units at the apartment complex also feature free WiFi.\n\nFabre Museum is 1.9 km from the apartment, while Odysseum Shopping Centre is 5.5 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 10 km from OVELIA Montpellier - Les Balcons de Montcalm.", "latitude": 43.6048583, "longitude": 3.8634255}
]