[
{"name": "Appart'City Confort Montpellier Saint Roch", "url": "https://www.booking.com/hotel/fr/appart-city-montpellier.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=1&hapos=1&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from_sustainable_property_sr=1&from=searchresults", "rating": "8.1", "address": "29-31, boulevard Berthelot, 34000 Montpellier, France", "description": "Appart'City Montpellier - Saint Roch is located near Montpellier's historic city centre, a 15-minute walk from Place de la Comédie and Montpellier central train station. It offers air-conditioned apartments and on-site parking. Free WiFi is available in public areas, while cabled Internet is provided in apartments.\n\nApartments at Appart'City Montpellier - Saint Roch have a flat-screen TV with Chromecast and private bathroom. Each apartment also has a fully-equipped kitchenette with a microwave and fridge. All apartments can be accessed by an elevator.\n\nA buffet breakfast is served daily on site. Breakfast is composed of various breads, pastries, fresh and hot beverages. Fresh fruit and fruit salad, as well as cheeses and yogurts are also provided. Additional facilities include a 24-hour reception desk.\n\nThe hotel is conveniently located just 300 metres from Nouveau Saint-Roch tram stop offering a direct transport link to the central station. Montpellier’s Arc de Triomphe is a 20-minute walk from the hotel.", "latitude": 43.59979212, "longitude": 3.87222067},
{"name": "Joli studio centre historique et au calme (2)", "url": "https://www.booking.com/hotel/fr/joli-studio-centre-historique-et-au-calme-2.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=15&hapos=15&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "7.5", "address": "7 Rue du Général Claparède, 34000 Montpellier, France", "description": "Joli studio centre historique et au calme (2) in Montpellier provides accommodation with free WiFi, 1.1 km from Place de la Comédie, less than 1 km from Montpellier Cathedral of Saint Peter and 2.9 km from Montpellier Town Hall. The property is around 1.4 km from The Corum, 1.2 km from Fabre Museum and 3.6 km from GGL Stadium. The property is 800 metres from the city centre and 800 metres from Montpellier National Opera.\n\nThe apartment is equipped with 1 bedroom, 1 bathroom, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchenette, and a balcony with quiet street views. The unit at the property features a shower and a dressing room. For added privacy, the accommodation features a private entrance.\n\nOdysseum Shopping Centre is 5.2 km from the apartment, while Agrolpolis International is 6.9 km away. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Joli studio centre historique et au calme (2).", "latitude": 43.60796822, "longitude": 3.87011029},
{"name": "Le Broc, Charmant T1 Mezz Centre Ville Corum", "url": "https://www.booking.com/hotel/fr/le-broc-charmant-t1-mezz-centre-ville-corum.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=19&hapos=19&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "10", "address": "2 Rue du Collège Duvergier, 34000 Montpellier, France", "description": "Located in Montpellier, 400 metres from Fabre Museum and 600 metres from Place de la Comédie, Le Broc, Charmant T1 Mezz Centre Ville Corum provides city views and free WiFi. The property is around 3 km from Montpellier Town Hall, 600 metres from Montpellier Cathedral of Saint Peter and 700 metres from Montpellier National Opera. The property is 500 metres from The Corum, and within 400 metres of the city centre.\n\nThis apartment is equipped with 1 bedroom, a kitchen with a microwave and a toaster, a flat-screen TV, a seating area and 1 bathroom. Towels and bed linen are provided in the apartment. The accommodation is non-smoking.\n\nOdysseum Shopping Centre is 4.3 km from the apartment, while Agrolpolis International is 6.6 km away. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Le Broc, Charmant T1 Mezz Centre Ville Corum.", "latitude": 43.6134022, "longitude": 3.8796723},
{"name": "Spacious room in Montpellier City Center", "url": "https://www.booking.com/hotel/fr/spacious-room-in-montpellier-cbd.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=21&hapos=21&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.3", "address": "15 Rue des Sœurs Noires, 34000 Montpellier, France", "description": "Spacious room in Montpellier City Center in Montpellier provides accommodation with free WiFi, less than 1 km from The Corum, a 9-minute walk from Fabre Museum and 700 metres from Place de la Comédie. The property is around 5.5 km from Montpellier Town Hall, 5.9 km from Agrolpolis International and 6.5 km from Montpellier Zoo. The property is 300 metres from the city centre and 700 metres from Montpellier Cathedral of Saint Peter.\n\nTowels and bed linen are featured in the homestay. The accommodation is non-smoking.\n\nMontpellier National Opera is 300 metres from the homestay, while Odysseum Shopping Centre is 6.8 km away. The nearest airport is Montpellier - Mediterranee Airport, 11 km from Spacious room in Montpellier City Center.", "latitude": 43.60895082, "longitude": 3.87513003},
{"name": "Studio St Ursule R2", "url": "https://www.booking.com/hotel/fr/appartement-st-ursule-2eme-etages.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=16&hapos=16&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "8.5", "address": "29 Rue Sainte-Ursule, 34000 Montpellier, France", "description": "Set in Montpellier, 500 metres from Fabre Museum and 800 metres from Place de la Comédie, Studio St Ursule R2 provides accommodation with amenities such as free WiFi and a flat-screen TV. The property is located 500 metres from Montpellier Cathedral of Saint Peter, 3.3 km from Montpellier Town Hall and less than 1 km from Montpellier National Opera. The property is 500 metres from the city centre and 600 metres from The Corum.\n\nThe apartment is composed of 1 separate bedroom, a fully equipped kitchen, and 1 bathroom. The accommodation is non-smoking.\n\nAgrolpolis International is 4.4 km from the apartment, while Odysseum Shopping Centre is 4.5 km away. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio St Ursule R2.", "latitude": 43.6140107, "longitude": 3.8779165},
{"name": "Les 4 étoiles", "url": "https://www.booking.com/hotel/fr/les-4-etoiles.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=17&hapos=17&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from_sustainable_property_sr=1&from=searchresults", "rating": "9.9", "address": "3 Rue Delmas, 34000 Montpellier, France", "description": "Set in Montpellier, 1.2 km from Place de la Comédie, les 4 etoiles features air-conditioned rooms and private parking.\n\nYou will find a coffee machine in the room. Each room is fitted with a private bathroom. Les 4 etoiles features free WiFi throughout the property.\n\nThere is a shared kitchen at the property.\n\nZenith Sud Montpellier is 4.4 km from les 4 etoiles, while Promenade du Peyrou is 500 metres away. The nearest airport is Montpellier - Mediterranee Airport, 8 km from les 4 etoiles.", "latitude": 43.61042273, "longitude": 3.86381006},
{"name": "Studio à 5 mn à pied de la gare Saint-Roch", "url": "https://www.booking.com/hotel/fr/studio-a-5-mn-a-pied-de-la-gare-saint-roch.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=20&hapos=20&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "7.6", "address": "29 Rue des Aiguerelles, 34000 Montpellier, France", "description": "Located in the centre of Montpellier, 1.5 km from Montpellier Town Hall, Studio à 5 mn à pied de la gare Saint-Roch provides air-conditioned accommodation with free WiFi and a flat-screen TV. The property is around 3.6 km from Odysseum Shopping Centre, 1.6 km from Montpellier Cathedral of Saint Peter and 4.3 km from GGL Stadium. The property is non-smoking and is situated less than 1 km from Montpellier National Opera.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are provided in the apartment.\n\nPopular points of interest near the apartment include Place de la Comédie, The Corum and Fabre Museum. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio à 5 mn à pied de la gare Saint-Roch.", "latitude": 43.6022125, "longitude": 3.8842535},
{"name": "Studio au coeur de Montpellier", "url": "https://www.booking.com/hotel/fr/studio-au-coeur-de-montpellier-montpellier2.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=18&hapos=18&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "7.5", "address": "7 Rue Sainte-Ursule, 34000 Montpellier, France", "description": "Studio au coeur de Montpellier in Montpellier offers accommodation with free WiFi, 400 metres from Fabre Museum, 700 metres from Place de la Comédie and 3 km from Montpellier Town Hall. The property is around 400 metres from Montpellier Cathedral of Saint Peter, 700 metres from Montpellier National Opera and 4.3 km from Odysseum Shopping Centre. The property is 400 metres from the city centre and 600 metres from The Corum.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are featured in the apartment. The accommodation is non-smoking.\n\nGGL Stadium is 6.1 km from the apartment, while Agrolpolis International is 6.6 km away. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio au coeur de Montpellier.", "latitude": 43.61334913, "longitude": 3.87835549},
{"name": "21 Centre Historique - Gare- Place de la Comédie", "url": "https://www.booking.com/hotel/fr/21-centre-historique-gare-place-de-la-comedie.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=14&hapos=14&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "8.6", "address": "Appartement 21 - 2eme étage 22 Rue Aristide Ollivier, 34000 Montpellier, France", "description": "In the centre of Montpellier, located within a short distance of Montpellier Town Hall and Montpellier National Opera, 21 Centre Historique - Gare- Place de la Comédie offers free WiFi, air conditioning and household amenities such as a microwave and coffee machine. The property features inner courtyard views and is less than 1 km from The Corum and a 8-minute walk from Fabre Museum. Place de la Comédie is 500 metres away and Odysseum Shopping Centre is 4 km from the apartment.\n\nThe recently renovated apartment is equipped with 1 separate bedroom, 1 bathroom, a fully equipped kitchen with a dining area and oven, and a living room with a flat-screen TV. Towels and bed linen are provided in the apartment. This apartment is non-smoking and soundproof.\n\nMontpellier Cathedral of Saint Peter is 1.1 km from the apartment, while GGL Stadium is 4.7 km away. The nearest airport is Montpellier - Mediterranee Airport, 8 km from 21 Centre Historique - Gare- Place de la Comédie.", "latitude": 43.6064202, "longitude": 3.8823168},
{"name": "Studio sous les toits très bien placé et climatisé", "url": "https://www.booking.com/hotel/fr/studio-sous-les-toits-tres-bien-place-et-climatise.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=12&hapos=12&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.0", "address": "1 Impasse Copé Cambes, 34000 Montpellier, France", "description": "Set in the centre of Montpellier, 200 metres from Montpellier National Opera and 500 metres from Place de la Comédie, Studio sous les toits très bien placé et climatisé offers free WiFi and air conditioning. The property is situated 4.4 km from Odysseum Shopping Centre, 4.6 km from GGL Stadium and 7.5 km from Agrolpolis International. The property is non-smoking and is located 2.4 km from Montpellier Town Hall.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are offered in the apartment.\n\nThere is a coffee shop on-site.\n\nPopular points of interest near the apartment include The Corum, Fabre Museum and Montpellier Cathedral of Saint Peter. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Studio sous les toits très bien placé et climatisé.", "latitude": 43.6078264, "longitude": 3.8766466},
{"name": "Charmant et lumineux appartement", "url": "https://www.booking.com/hotel/fr/charmant-et-lumineux-appartement.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=13&hapos=13&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.2", "address": "29 Rue Chaptal, 34000 Montpellier, France", "description": "In a central area of Montpellier, located within a short distance of Montpellier Cathedral of Saint Peter and Montpellier National Opera, Charmant et lumineux appartement offers free WiFi, air conditioning and household amenities such as a fridge and coffee machine. This recently renovated apartment is located 1.3 km from Place de la Comédie and 3.3 km from GGL Stadium. The property is non-smoking and is set 3.4 km from Montpellier Town Hall.\n\nThis apartment comes with 1 bedroom, a kitchen with a microwave and a toaster, a flat-screen TV, a seating area and 1 bathroom equipped with a shower. Towels and bed linen are featured in the apartment. For added privacy, the accommodation features a private entrance.\n\nThe Corum is 1.7 km from the apartment, while Fabre Museum is 1.4 km away. The nearest airport is Montpellier - Mediterranee Airport, 12 km from Charmant et lumineux appartement.", "latitude": 43.6047085, "longitude": 3.8697061},
{"name": "OVELIA Montpellier - Les Balcons de Montcalm", "url": "https://www.booking.com/hotel/fr/ovelia-montpellier-les-balcons-de-montcalm.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=11&hapos=11&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "8.7", "address": "18 Rue de Claret, 34070 Montpellier, France", "description": "OVELIA Montpellier - Les Balcons de Montcalm is situated in Montpellier, 1.5 km from Montpellier National Opera, 1.6 km from Montpellier Cathedral of Saint Peter, and 1.9 km from Place de la Comédie. The property is located 2.9 km from GGL Stadium, 3.3 km from Montpellier Town Hall and 3.6 km from The Corum. Private parking can be arranged at an extra charge.\n\nFeaturing a private bathroom, units at the apartment complex also feature free WiFi.\n\nFabre Museum is 1.9 km from the apartment, while Odysseum Shopping Centre is 5.5 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 10 km from OVELIA Montpellier - Les Balcons de Montcalm.", "latitude": 43.6048583, "longitude": 3.8634255},
{"name": "le balcon de Saint Roch", "url": "https://www.booking.com/hotel/fr/roucher.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=9&hapos=9&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "8.5", "address": "32 Rue Roucher, 34000 Montpellier, France", "description": "Right in the centre of Montpellier, situated within a short distance of Montpellier National Opera and Place de la Comédie, le balcon de Saint Roch offers free WiFi, air conditioning and household amenities such as an oven and coffee machine. Boasting free shuttle service, this property also provides guests with a sun terrace. The property is non-smoking and is set 700 metres from Montpellier Cathedral of Saint Peter.\n\nThe apartment has 1 bedroom, 1 bathroom, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchen, and a balcony with city views. For added privacy, the accommodation has a private entrance and soundproofing.\n\nMontpellier Town Hall is 2.6 km from the apartment, while The Corum is 1 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 9 km from le balcon de Saint Roch.", "latitude": 43.60798576, "longitude": 3.87482351},
{"name": "Studio coeur de ville et au calme (1)", "url": "https://www.booking.com/hotel/fr/studio-coeur-de-ville-et-au-calme-1-montpellier.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=8&hapos=8&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "8.3", "address": "7 Rue du Général Claparède, 34000 Montpellier, France", "description": "Set in the centre of Montpellier, just 800 metres from Montpellier National Opera and 1.1 km from Place de la Comédie, Studio coeur de ville et au calme (1) offers accommodation with quiet street views and free WiFi. The property is around 2.9 km from Montpellier Town Hall, 1.4 km from The Corum and 1.1 km from Fabre Museum. The property is non-smoking and is located less than 1 km from Montpellier Cathedral of Saint Peter.\n\nThe apartment has 1 bedroom, a flat-screen TV, a fully equipped kitchenette with a microwave and a toaster, and 1 bathroom with a shower. Towels and bed linen are offered in the apartment. For added privacy, the accommodation features a private entrance.\n\nGGL Stadium is 3.6 km from the apartment, while Odysseum Shopping Centre is 5.2 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Studio coeur de ville et au calme (1).", "latitude": 43.6079857, "longitude": 3.8701237},
{"name": "Jacques III d'aragon", "url": "https://www.booking.com/hotel/fr/jacques-iii-d-aragon.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=10&hapos=10&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.4", "address": "10 Rue de l'Argenterie, 34000 Montpellier, France", "description": "Offering inner courtyard views, Jacques III d'aragon is an accommodation located in Montpellier, 700 metres from The Corum and 500 metres from Fabre Museum. It is set 400 metres from Place de la Comédie and offers luggage storage space. The property is 100 metres from the city centre and 600 metres from Montpellier Cathedral of Saint Peter.\n\nWith free WiFi, this 1-bedroom apartment provides a cable flat-screen TV and a kitchenette with an oven and microwave. Towels and bed linen are provided in the apartment. For added privacy, the accommodation features a private entrance.\n\nMontpellier Town Hall is 5.5 km from the apartment, while Agrolpolis International is 5.9 km away. The nearest airport is Montpellier - Mediterranee Airport, 11 km from Jacques III d'aragon.", "latitude": 43.60925165, "longitude": 3.8776916},
{"name": "Le petit Saint Jean T2, Clim, Centre historique", "url": "https://www.booking.com/hotel/fr/le-petit-saint-jean-t2-clim-centre-historique.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=25&hapos=25&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "7.7", "address": "8 Rue du Petit Saint-Jean, 34000 Montpellier, France", "description": "Right in the heart of Montpellier, situated within a short distance of Montpellier National Opera and Place de la Comédie, Le petit Saint Jean T2, Clim, Centre historique offers free WiFi, air conditioning and household amenities such as a toaster and coffee machine. The property has inner courtyard views and is 1 km from The Corum and 800 metres from Fabre Museum. The property is non-smoking and is located 2.3 km from Montpellier Town Hall.\n\nThis apartment features 1 bedroom, a kitchen with an oven and a microwave, a flat-screen TV, a seating area and 1 bathroom. Towels and bed linen are available in the apartment. At the apartment, there is a dressing room for guests to change in.\n\nDining options are available close to Le petit Saint Jean T2, Clim, Centre historique.\n\nMontpellier Cathedral of Saint Peter is 700 metres from the accommodation, while Odysseum Shopping Centre is 4.4 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Le petit Saint Jean T2, Clim, Centre historique.", "latitude": 43.6080942, "longitude": 3.8753738},
{"name": "ibis Grenoble Centre Bastille", "url": "https://www.booking.com/hotel/fr/ibis-grenoble-centre.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=25&hapos=25&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from_sustainable_property_sr=1&from=searchresults", "rating": "7.2", "address": "5 rue Miribel - Tramway Victor Hugo, 38000 Grenoble, France", "description": "Located in the centre of Grenoble, ibis Grenoble Centre offers a 24-hour reception bar and free Wi-Fi access throughout. Victor Hugo Tramway is situated outside the hotel and the Bastille Cable Car is 500 metres away.\n\nAll rooms are air-conditioned and feature a flat-screen TV with cable channels, a wardrobe, a desk and a telephone. The en suite bathroom includes a hairdryer and free toiletries.\n\nA buffet breakfast composed of sweet and savoury dishes such as eggs, fruit salad, yogurts and juices is served every day. Pastries baked on site and fresh French Madeleine cakes are also on offer, as well as a hot beverage and a piece of fruit to take away. Outside of regular breakfast hours guests can also enjoy a lighter option, available from 04:00.\n\nAdditional features include luggage storage, daily newspapers and an elevator. Victor Hugo Square is 100 metres away and private parking is possible on site.", "latitude": 45.19052518, "longitude": 5.72641228},
{"name": "Garden in the city - Train station/City center", "url": "https://www.booking.com/hotel/fr/garden-in-the-city-train-station-city-center.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=24&hapos=24&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "9.3", "address": "35 Rue Revol, 38000 Grenoble, France", "description": "Garden in the city - Train station/City center, a property with a garden and a terrace, is situated in Grenoble, 700 metres from WTC Grenoble, 6.6 km from AlpExpo, as well as 3 km from Alps Stadium. The property is set 5.3 km from The Bastille Grenoble, 6.8 km from Summum and 32 km from Col de Parménie. Free WiFi is available throughout the property and Grenoble Train Station is 600 metres away.\n\nThe 2-bedroom apartment features a living room with a flat-screen TV, a fully equipped kitchen with a dishwasher and an oven, and 1 bathroom with a hair dryer. Towels and bed linen are available in the apartment. The accommodation is non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nThe nearest airport is Alpes–Isère Airport, 45 km from the apartment.", "latitude": 45.189766, "longitude": 5.707985},
{"name": "Appartement cosy dans les rues piétonnes", "url": "https://www.booking.com/hotel/fr/studio-entierement-renove-dans-les-rue-pietonnes.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=22&hapos=22&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "9.3", "address": "14 Rue Saint-Jacques, 38000 Grenoble, France", "description": "In the Grenoble City Centre district of Grenoble, close to WTC Grenoble, Appartement cosy dans les rues piétonnes has free WiFi and a washing machine. The property is around 5.4 km from AlpExpo, 1.3 km from Alps Stadium and 2 km from The Bastille Grenoble. The property is 200 metres from the city centre and 1.3 km from Grenoble Train Station.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is offered. The accommodation is non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nSummum is 5.6 km from the apartment, while Col de Parménie is 34 km from the property. The nearest airport is Alpes–Isère Airport, 47 km from Appartement cosy dans les rues piétonnes.", "latitude": 45.1896541, "longitude": 5.7279924},
{"name": "Adagio Grenoble Centre", "url": "https://www.booking.com/hotel/fr/hipark.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=21&hapos=21&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from_sustainable_property_sr=1&from=searchresults", "rating": "7.3", "address": "6 rue Auguste Genin, 38000 Grenoble, France", "description": "Adagio Grenoble Centre is located in the Europole business district of Grenoble, a 5-minute walk from the city’s TGV Train Station and a 10-minute walk from the city centre. With studios and suites, it offers free WiFi access, a fitness room and a sauna.\n\nAll the contemporary studios and suites are equipped with interactive TV and a fully equipped kitchen.\n\nAdagio Grenoble Centre serves a daily continental breakfast as well as full concierge services.\n\nGrenobles old town and Notre Dame Cathedral are within easy walking distance. The A480 motorway is 1.3 kilometres away for guests exploring the Rhone-Alpes region by car.", "latitude": 45.18960902, "longitude": 5.7121785},
{"name": "Appartements Residilaverde Gare", "url": "https://www.booking.com/hotel/fr/residilaverde-gare.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=19&hapos=19&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "8.8", "address": "59 Avenue Alsace Lorraine, 38000 Grenoble, France", "description": "Located in the heart of Grenoble, Appartement Residilaverde Gare proposes self-catering accommodation just 100 metres from the train station and 900 metres from Bastille Cable Car.\n\nAll accommodation is air-conditioned and features a flat-screen TV with satellite channels, free Wi-Fi access, a washing machine and a dryer. They are complete with a private bathroom.\n\nThe fully equipped kitchen in each apartment includes a coffee machine, refrigerator, oven, kettle and a toaster. Restaurants and bars can be found within walking distance.\n\nMistral Park is a 20-mintue walk from the accommodation. Private parking is possible on site.", "latitude": 45.18988406, "longitude": 5.71627691},
{"name": "Chambre au Cœur Grenoble - Calme & Tout Equipé avec WIFI", "url": "https://www.booking.com/hotel/fr/chambre-au-coeur-grenoble-calme-amp-tout-equipe-avec-wifi.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=20&hapos=20&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "10", "address": "102 23 Rue Ampère, 38000 Grenoble, France", "description": "Featuring accommodation with a balcony, Chambre au Cœur Grenoble - Calme & Tout Equipé avec WIFI is located in Grenoble. The property is set 1.2 km from WTC Grenoble, 6 km from AlpExpo and 3.8 km from Alps Stadium. Free WiFi is available throughout the property and Grenoble Train Station is 1.1 km away.\n\nThe air-conditioned apartment consists of 1 bedroom, a fully equipped kitchen and 1 bathroom. A flat-screen TV is provided. The accommodation is non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nThe Bastille Grenoble is 5.6 km from the apartment, while Summum is 6.2 km away. The nearest airport is Alpes–Isère Airport, 45 km from Chambre au Cœur Grenoble - Calme & Tout Equipé avec WIFI.", "latitude": 45.1862613, "longitude": 5.7059208},
{"name": "ibis Grenoble Gare", "url": "https://www.booking.com/hotel/fr/ibis-grenoble-gare.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=18&hapos=18&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "7.4", "address": "27 Quai Claude Bernard, 38000 Grenoble, France", "description": "Set just 200 metres from Grenoble Train Station, ibis Grenoble Gare offers air-conditioned rooms with mountain views and free Wi-Fi. It has a 24-hour reception and you can enjoy a drink from the bar. It is a 5-minute walk from the city centre.\n\nDecorated in a modern style, the guest rooms all include an LCD TV with satellite channels. Each is soundproofed and has  a telephone, desk and a private bathroom complete with a hairdryer.\n\nA buffet breakfast composed of sweet and savoury dishes such as eggs, fruit salad, yogurts and juices is served every day. Pastries baked on site and fresh French Madeleine cakes are also on offer, as well as a hot beverage and a piece of fruit to take away. Outside of regular breakfast hours guests can also enjoy a lighter option, available from 04:00. Snacks and drinks can be ordered at any time from the 24-hour reception.\n\nPrivate parking is available on site, at an extra cost. Grenoble Museum is only 1 km away and the Fort de la Bastille is 2 km from the hotel. Traditional French restaurants can be found within 400 metres.The property is 1.5 km from A480 highway.", "latitude": 45.192898, "longitude": 5.71739092},
{"name": "La loge parisienne 300m gare Bastille Téléphérique", "url": "https://www.booking.com/hotel/fr/la-loge-parisienne-300m-gare-bastille-telepherique.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=23&hapos=23&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "8.9", "address": "5 Place Hubert Dubedout, 38000 Grenoble, France", "description": "Offering city views, La loge parisienne 300m gare Bastille Téléphérique is an accommodation set in Grenoble, 800 metres from WTC Grenoble and 5.4 km from AlpExpo. Among the facilities at this property are private check-in and check-out and bicycle parking, along with free WiFi throughout the property. The property is non-smoking and is situated 500 metres from Grenoble Train Station.\n\nThe recently renovated apartment features 1 separate bedroom, 1 bathroom, a fully equipped kitchen with a dining area and oven, and a living room with a flat-screen TV.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nAlps Stadium is 2.3 km from the apartment, while The Bastille Grenoble is 1.8 km from the property. The nearest airport is Alpes–Isère Airport, 46 km from La loge parisienne 300m gare Bastille Téléphérique.", "latitude": 45.19202797, "longitude": 5.71983267},
{"name": "Hyper centre Grenoble", "url": "https://www.booking.com/hotel/fr/hyper-centre-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=17&hapos=17&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "0.0", "address": "14 Place Notre Dame, 38000 Grenoble, France", "description": "In the Grenoble City Centre district of Grenoble, close to WTC Grenoble, Hyper centre Grenoble features a bar and a washing machine. Among the facilities at this property are a concierge service and a minimarket, along with free WiFi throughout the property. The property is 1.5 km from Grenoble Train Station, and within 300 metres of the city centre.\n\nThis apartment comes with 1 bedroom, a kitchen with a dishwasher and an oven, a flat-screen TV, a seating area and 1 bathroom equipped with a walk-in shower. Guests can enjoy an ambient stay in their soundproof room with parquet floors and a fireplace. This apartment is allergy-free and non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nGuests at the apartment will be able to enjoy activities in and around Grenoble, like walking tours.\n\nAlpExpo is 6.6 km from Hyper centre Grenoble, while Alps Stadium is 1.2 km away. The nearest airport is Alpes–Isère Airport, 47 km from the accommodation.", "latitude": 45.192591, "longitude": 5.7308907},
{"name": "Les baleines - hypercentre 2 chambres avec garage et clim - air conditioning", "url": "https://www.booking.com/hotel/fr/les-baleines-championnet-avec-garage-et-clim.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=16&hapos=16&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "9.9", "address": "24 bis Rue des Bergers, 38000 Grenoble, France", "description": "Situated 1.1 km from Grenoble Train Station and 1.4 km from WTC Grenoble in the centre of Grenoble, Les baleines - hypercentre 2 chambres avec garage et clim - air conditioning features accommodation with free WiFi and free private parking. The property has garden and inner courtyard views, and is 1.7 km from Alps Stadium. The property is non-smoking and is set 5.2 km from AlpExpo.\n\nThe air-conditioned apartment consists of 2 bedrooms, a living room, a fully equipped kitchen with a dishwasher and a coffee machine, and 1 bathroom with a shower and slippers. A flat-screen TV is available. The apartment offers bed linen, towels and laundry service.\n\nSkiing, walking tours and bike tours are possible within the area, and the apartment offers ski storage space.\n\nThe Bastille Grenoble is 4.7 km from Les baleines - hypercentre 2 chambres avec garage et clim - air conditioning, while Summum is 5.4 km from the property. The nearest airport is Alpes–Isère Airport, 46 km from the accommodation.", "latitude": 45.1858623, "longitude": 5.72202917},
{"name": "Hôtel de l'Europe Grenoble hyper-centre", "url": "https://www.booking.com/hotel/fr/de-l-europe-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=13&hapos=13&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "8.2", "address": "22 Place Grenette, 38000 Grenoble, France", "description": "Hôtel de l'Europe Grenoble hyper-centre is located in the heart of Grenoble and is the oldest hotel in the city. It is set in a 17th-century building. Free WiFi is provided.\n\nAll rooms are air-conditioned and soundproofed. They come with a flat-screen TV with Bein Sports, Canal+ and Eurosport satellite channels. Some rooms also feature a balcony with views of the city.\n\nHôtel de l'Europe Grenoble hyper-centre offers a daily continental breakfast, which can also be served in the guest room upon request.\n\nHôtel de l'Europe Grenoble hyper-centre is 350 metres from the cable car that goes up to the Bastille. Grenoble train station is 1 km away, or a 5-minute journey by tram. Public parking is available nearby.", "latitude": 45.19035711, "longitude": 5.72733097},
{"name": "Hôtel d’Angleterre Grenoble Hyper-Centre", "url": "https://www.booking.com/hotel/fr/tiangleterre.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=15&hapos=15&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from_sustainable_property_sr=1&from=searchresults", "rating": "7.7", "address": "5, place Victor Hugo, 38000 Grenoble, France", "description": "Hôtel d’Angleterre Grenoble Hyper-Centre is set in the heart of Grenoble, opposite the gardens of Place Victor Hugo. It is just a 1-minute walk to the Victor Hugo tram stop and offers free WiFi and an onsite bar .\n\nAll the rooms are soundproofed and air-conditioned. They feature a desk, a LCD satellite TV and a DVD player. The private bathrooms come with free toiletries. Some rooms also have a hydro-massage bathtub and a private balcony with views over the Vercors mountain range.\n\nA buffet breakfast is available every day and includes hot, cold, sweet and savoury options. An other continental breakfast option consisting of a hot drink, a juice, a pasty, bread, butter and jam is also available.\n\nAn underground car park is available nearby at an extra charge.  The nearest airport is Grenoble - Isère Airport, 45 km from the accommodation.", "latitude": 45.18920402, "longitude": 5.72537228},
{"name": "Le Grand Hôtel Grenoble, BW Premier Collection by Best Western", "url": "https://www.booking.com/hotel/fr/le-grand-grenoble-centre.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=11&hapos=11&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "8.4", "address": "5 rue de la Republique, 38000 Grenoble, France", "description": "In the heart of the historic city centre of the Capital of the Alps, the Grand Hôtel de Grenoble **** BW Premier Collection is waiting to welcome you to an unforgettable experience.\n\nWhether you are on a business trip or a sporting getaway, our attentive and dedicated team is here to offer you a quality of service that lives up to your expectations and up-to-date facilities.\n\nRelax in our newly refurbished rooms and suites. Enjoy a breakfast of fresh, local and seasonal produce. Bring your best projects to life in our coworking space.\nAt the Grand Hôtel de Grenoble **** BW Premier Collection, every detail is carefully orchestrated to make your stay an unforgettable experience. We look forward to welcoming you and offering you an exceptional stay in Grenoble.\n\nOur hotel is located in the heart of a pedestrianised street, and can be reached by public transport or by car by parking in the Saint-Claire Les Halles private car park, formerly the Lafayette car park (preferential rate).", "latitude": 45.19081504, "longitude": 5.72854802},
{"name": "Le Bon Quai", "url": "https://www.booking.com/hotel/fr/le-bon-quai.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=12&hapos=12&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "9.2", "address": "40 Quai de France, 38000 Grenoble, France", "description": "Le Bon Quai features a terrace and is set in Grenoble, within just 1.1 km of WTC Grenoble and 1.6 km of The Bastille Grenoble. It is situated 5.9 km from AlpExpo and features a lift. The property is 800 metres from Grenoble Train Station, and within 600 metres of the city centre.\n\nWith free WiFi, this 1-bedroom apartment offers a flat-screen TV, a washing machine and a fully equipped kitchen with an oven and microwave. Towels and bed linen are featured in the apartment. The accommodation is non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nAlps Stadium is 2.7 km from the apartment, while Summum is 6.1 km away. The nearest airport is Alpes–Isère Airport, 45 km from Le Bon Quai.", "latitude": 45.19393586, "longitude": 5.72086807},
{"name": "Le petit Championnet T2", "url": "https://www.booking.com/hotel/fr/le-petit-championnet-t2.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=14&hapos=14&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "8.6", "address": "5 Rue Aubert Dubayet, 38000 Grenoble, France", "description": "Le petit Championnet T2 offers accommodation located 600 metres from the centre of Grenoble and features a garden and a terrace. The property is around 1.4 km from WTC Grenoble, 4.8 km from AlpExpo and 1.6 km from Alps Stadium. The property is non-smoking and is set 1.1 km from Grenoble Train Station.\n\nWith free WiFi, this 1-bedroom apartment provides a flat-screen TV, a washing machine and a fully equipped kitchen with a microwave. Towels and bed linen are featured in the apartment.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nThe Bastille Grenoble is 4.5 km from the apartment, while Summum is 5 km away. The nearest airport is Alpes–Isère Airport, 46 km from Le petit Championnet T2.", "latitude": 45.18625274, "longitude": 5.72364816},
{"name": "Residhotel Grenette", "url": "https://www.booking.com/hotel/fr/le-royal-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=9&hapos=9&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from_sustainable_property_sr=1&from=searchresults", "rating": "7.5", "address": "12 Rue De Palanka, 38000 Grenoble, France", "description": "Residhotel Grenette is located in central Grenoble, a 3-minute walk away from Place Victor Hugo. It offers self-catering accommodation with free WiFi.\n\nEach unit has a living area with work desk and cable TV.  The kitchenette features a hot-plate, microwave, refrigerator and coffee maker.\n\nThe Residhotel provides a daily buffet breakfast service which is served in its breakfast room.\n\nThe Grenette is only a 5-minute walk from the historic centre of Grenoble, and the train station is 800 metres away. Private parking spaces are limited and available at an extra charge upon reservation and depending on availability.", "latitude": 45.19056363, "longitude": 5.72448447},
{"name": "Maison Barbillon Grenoble", "url": "https://www.booking.com/hotel/fr/maison-barbillon-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=10&hapos=10&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from_sustainable_property_sr=1&from=searchresults", "rating": "8.3", "address": "10, Rue Barbillon, 38000 Grenoble, France", "description": "Maison Barbillon Grenoble is located in Grenoble, just 100 metres from the train station. It offers comfortable guest rooms with satellite TV and free WiFi Internet access.\n\nGuest rooms at the Maison Barbillon Grenoble have an authentic and elegant décor and feature a private bathroom including a hairdryer.\n\nA buffet breakfast is served every morning in the breakfast room. There are many restaurants within walking distance of the hotel.\n\nMaison Barbillon is accessible via the A480 motorway. The hotel is located beside Grenoble World Trade Centre and Saint-André Cathedral is just a 13-minute walk away.", "latitude": 45.1907933, "longitude": 5.71669668},
{"name": "Studio Noix à 10 minutes à pied de la gare de Grenoble", "url": "https://www.booking.com/hotel/fr/charmant-studio-a-10-minutes-a-pied-de-la-gare-de-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=6&hapos=6&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "10", "address": "6 Rue Charles Lory, 38000 Grenoble, France", "description": "Set 1.7 km from WTC Grenoble, 4.9 km from AlpExpo and 2.9 km from Alps Stadium, Studio Noix à 10 minutes à pied de la gare de Grenoble offers accommodation located in Grenoble. The property is around 5.1 km from Summum, 6.8 km from The Bastille Grenoble and 34 km from Col de Parménie. Free WiFi is available throughout the property and Grenoble Train Station is 1.5 km away.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is offered. The accommodation is non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nThe nearest airport is Alpes–Isère Airport, 47 km from the apartment.", "latitude": 45.1810577, "longitude": 5.7145748},
{"name": "Le petit Cosy", "url": "https://www.booking.com/hotel/fr/le-petit-cosy-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=5&hapos=5&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "10", "address": "3 Rue Paul Janet, 38000 Grenoble, France", "description": "Situated 1.8 km from Grenoble Train Station, 2.9 km from WTC Grenoble and 4.5 km from AlpExpo, Le petit Cosy features accommodation located in Grenoble. The property is around 1 km from Alps Stadium, 4.7 km from Summum and 4.9 km from The Bastille Grenoble.\n\nThe accommodation is non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nCol de Parménie is 35 km from the apartment. The nearest airport is Alpes–Isère Airport, 48 km from Le petit Cosy.", "latitude": 45.1827346, "longitude": 5.7306284},
{"name": "COWOOL GRENOBLE", "url": "https://www.booking.com/hotel/fr/cowool-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=8&hapos=8&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "7.8", "address": "1 Avenue d'Innsbruck, 38100 Grenoble, France", "description": "500 metres from AlpExpo, COWOOL GRENOBLE is a recently renovated property situated in Grenoble and features air-conditioned rooms with free WiFi and private parking. Boasting a lift, this property also provides guests with a sun terrace. The aparthotel has family rooms and facilities for disabled guests.\n\nEach unit has a fully equipped kitchen with a microwave, a seating area, a TV, a washing machine, and a private bathroom with bath and a hair dryer. A fridge, a stovetop and kitchenware are also offered, as well as a coffee machine. At the aparthotel, units are fitted with bed linen and towels.\n\nThere is a coffee shop, and packed lunches are also available. During the colder months, guests can enjoy winter sports in the surrounding area.\n\nFitness classes are available at the property. A bicycle rental service is available at the aparthotel.\n\nGrenoble Train Station is 5.2 km from COWOOL GRENOBLE, while WTC Grenoble is 6.6 km from the property. The nearest airport is Alpes–Isère Airport, 50 km from the accommodation.", "latitude": 45.1586663, "longitude": 5.734091},
{"name": "10min Gare Grenoble, vrai lit double, calme", "url": "https://www.booking.com/hotel/fr/10min-gare-grenoble-vrai-lit-double-calme.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=7&hapos=7&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "9.3", "address": "65 Boulevard Joseph Vallier, 38100 Grenoble, France", "description": "10min Gare Grenoble, vrai lit double, calme is set in Grenoble, 5 km from AlpExpo, 3 km from Alps Stadium, and 5.2 km from Summum. It is located 1.9 km from WTC Grenoble and provides a lift. Free WiFi is available throughout the property and Grenoble Train Station is 1.8 km away.\n\nThe apartment features 1 bedroom, a TV, a fully equipped kitchen with an oven and a microwave, a washing machine, and 1 bathroom with a shower. Towels and bed linen are provided in the apartment. The accommodation is non-smoking.\n\nDuring the colder months, guests can enjoy winter sports in the surrounding area.\n\nThe Bastille Grenoble is 6.7 km from the apartment, while Col de Parménie is 33 km away. The nearest airport is Alpes–Isère Airport, 46 km from 10min Gare Grenoble, vrai lit double, calme.", "latitude": 45.1798108, "longitude": 5.7060371},
{"name": "Les Appartements de Grenoble", "url": "https://www.booking.com/hotel/fr/apt-paisible-en-centre-ville-parking-salle-de-sport-bar-en-rooftop.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=4&hapos=4&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "8.6", "address": "15 Rue Maurice Gignoux, 38000 Grenoble, France", "description": "Situated conveniently in Grenoble, Les Appartements de Grenoble offers a buffet breakfast and free WiFi. The property features mountain and garden views, and is 1.9 km from Grenoble Train Station. Featuring family rooms, this property also provides guests with a sun terrace.\n\nEach unit is fitted with a fully equipped kitchen with a dishwasher, a seating area, a flat-screen TV, a washing machine, and a private bathroom with shower and a hair dryer. A microwave, a fridge and stovetop are also featured, as well as a coffee machine and a kettle. The units at the aparthotel feature air conditioning and a desk.\n\nThe family-friendly restaurant at the aparthotel serves local cuisine, and is open for dinner and lunch. During the colder months, guests can enjoy winter sports in the surrounding area.\n\nA bicycle rental service is available at Les Appartements de Grenoble.\n\nWTC Grenoble is 2.7 km from the accommodation, while AlpExpo is 6.3 km away. The nearest airport is Alpes–Isère Airport, 46 km from Les Appartements de Grenoble.", "latitude": 45.19581084, "longitude": 5.72544678},
{"name": "1924 Hôtel", "url": "https://www.booking.com/hotel/fr/royal-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=3&hapos=3&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from_sustainable_property_sr=1&from=searchresults", "rating": "8.6", "address": "2 Rue Gabriel Peri, 38000 Grenoble, France", "description": "Located in the heart of Grenoble on a quiet street, only 450 metres from the SNCF train station and offers free WiFi, service clean, comfortable rooms with modern facilities and a friendly, relaxed atmosphere.\n\nAll the cosy guest rooms are equipped with all modern amneties, en suite facilities, soundproofing and satellite TV. All rooms are served by a small lift. Some allow you to see the mountain Vercors.\n\n The helpful staff at this delightful hotel will help you to make the most of your visit. Local and Bio breakfast is served every morning. Guests can find restaurants nearby.\n\nExplore Grenoble on foot, with our bikes available, or using the excellent public transport links. Guests will appreciate the tramwa stop just a stone's throw from the hotel, providing easy access to the city's business districts and famous sites", "latitude": 45.18928483, "longitude": 5.71861982},
{"name": "RockyPop Grenoble Hotel", "url": "https://www.booking.com/hotel/fr/rockypop-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=1&hapos=1&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from_sustainable_property_sr=1&from=searchresults", "rating": "8.5", "address": "9 Rue de Strasbourg, 38000 Grenoble, France", "description": "Situated in Grenoble, 1.6 km from Grenoble Train Station, RockyPop Grenoble Hotel features accommodation with a fitness centre, private parking, a garden and a terrace. Featuring a restaurant, the property also has a bar, as well as a sauna. The property is 1.9 km from WTC Grenoble, and within 600 metres of the city centre.\n\nThe hotel will provide guests with air-conditioned rooms offering a desk, a coffee machine, a safety deposit box, a flat-screen TV and a private bathroom with a bath or shower. The rooms will provide guests with a wardrobe and a kettle.\n\nA buffet, continental or Full English/Irish breakfast can be enjoyed at the property.\n\nYou can play table tennis at this 4-star hotel, and bike hire is available.\n\nSpeaking English and French, staff will be happy to provide guests with practical advice on the area at the 24-hour front desk.\n\nAlpExpo is 4.8 km from RockyPop Grenoble Hotel, while Alps Stadium is less than 1 km from the property. The nearest airport is Alpes–Isère Airport, 48 km from the accommodation.", "latitude": 45.186911, "longitude": 5.731293},
{"name": "Hôtel Victoria", "url": "https://www.booking.com/hotel/fr/victoria-grenoble.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCD3NlYXJjaF9ncmVub2JsZUgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiQ2ODI2NDg0OC05YzI5LTRjOTctYjdiZS1hZDBkZjNlMWI4NzfYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=2&hapos=2&sr_order=popularity&srpvid=be4c72004e8101b9&srepoch=1718727171&from=searchresults", "rating": "8.5", "address": "17 Rue Thiers, 38000 Grenoble, France", "description": "Ideally set in the centre of Grenoble, Hôtel Victoria offers free WiFi throughout the property and free private parking for guests who drive. The property is situated 1.2 km from WTC Grenoble, 5.2 km from AlpExpo and 1.8 km from Alps Stadium. The property is non-smoking and is set less than 1 km from Grenoble Train Station.\n\nAt the hotel, rooms are equipped with a wardrobe. The private bathroom is fitted with a shower and free toiletries. At Hôtel Victoria the rooms come with a flat-screen TV with cable channels.\n\nThe Bastille Grenoble is 4.7 km from the accommodation, while Summum is 5.4 km from the property. The nearest airport is Alpes–Isère Airport, 46 km from Hôtel Victoria.", "latitude": 45.187494, "longitude": 5.721472},
{"name": "Eklo Montpellier Centre Gare", "url": "https://www.booking.com/hotel/fr/eklo-montepellier-centre-gare.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=24&hapos=24&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from_sustainable_property_sr=1&from=searchresults", "rating": "8.3", "address": "4 Rue Jules Ferry, 34000 Montpellier, France", "description": "Ideally located in the centre of Montpellier, Eklo Montpellier Centre Gare offers air-conditioned rooms, a garden, free WiFi and a shared lounge. Boasting a 24-hour front desk, this property also welcomes guests with a restaurant and a terrace. Private parking is available on site.\n\nAt the hotel, the rooms are equipped with a wardrobe. All guest rooms feature a private bathroom, free toiletries and bed linen.\n\nA buffet breakfast is available every morning at Eklo Montpellier Centre Gare.\n\nPopular points of interest near the accommodation include Montpellier Town Hall, Montpellier National Opera and Place de la Comédie. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Eklo Montpellier Centre Gare.", "latitude": 43.60572, "longitude": 3.88134},
{"name": "Suite indépendante avec 1 chambre et 1 bureau", "url": "https://www.booking.com/hotel/fr/suite-independante-avec-1-chambre-et-1-bueau.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=6&hapos=6&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.6", "address": "17 Rue Desmazes, 34000 Montpellier, France", "description": "Located 1.1 km from Montpellier National Opera and 1.4 km from Place de la Comédie in the centre of Montpellier, Suite indépendante avec 1 chambre et 1 bureau provides accommodation with free WiFi and free private parking. With garden views, this accommodation features a terrace. The property is non-smoking and is situated 1.3 km from Montpellier Cathedral of Saint Peter.\n\nTowels and bed linen are provided in the bed and breakfast.\n\nGuests can also relax in the garden.\n\nGGL Stadium is 2.9 km from the bed and breakfast, while Montpellier Town Hall is 3.2 km away. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Suite indépendante avec 1 chambre et 1 bureau.", "latitude": 43.6050372, "longitude": 3.8682942},
{"name": "Charmant Studio Neuf N•2 - Centre ville", "url": "https://www.booking.com/hotel/fr/charmant-studio-neuf-n-2-centre-ville.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=22&hapos=22&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "7.9", "address": "23 Rue du Plan de l'Olivier, 34000 Montpellier, France", "description": "Situated in Montpellier, 400 metres from Fabre Museum and 700 metres from Place de la Comédie, Charmant Studio Neuf N•2 - Centre ville provides accommodation with amenities such as free WiFi and a flat-screen TV. The property is around 3 km from Montpellier Town Hall, 400 metres from Montpellier Cathedral of Saint Peter and 700 metres from Montpellier National Opera. The property is 600 metres from The Corum, and within 400 metres of the city centre.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. Towels and bed linen are available in the apartment. The accommodation is non-smoking.\n\nOdysseum Shopping Centre is 4.3 km from the apartment, while Agrolpolis International is 6.6 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Charmant Studio Neuf N•2 - Centre ville.", "latitude": 43.6132661, "longitude": 3.8783153},
{"name": "Ravissant T3 Neuf Climatisé - Centre ville", "url": "https://www.booking.com/hotel/fr/ravissant-t3-neuf-climatise-centre-ville.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=5&hapos=5&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "0.0", "address": "23 Rue du Plan de l'Olivier, 34000 Montpellier, France", "description": "In the heart of Montpellier, set within a short distance of The Corum and Fabre Museum, Ravissant T3 Neuf Climatisé - Centre ville offers free WiFi, air conditioning and household amenities such as a microwave and coffee machine. Guests staying at this apartment have access to a balcony. The property is non-smoking and is situated 700 metres from Place de la Comédie.\n\nThis apartment is fitted with 1 bedroom, a kitchen with a dishwasher and an oven, a flat-screen TV, a seating area and 1 bathroom fitted with a shower. Towels and bed linen are offered in the apartment. For added privacy, the accommodation features a private entrance.\n\nMontpellier Town Hall is 3 km from the apartment, while Montpellier Cathedral of Saint Peter is 400 metres from the property. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Ravissant T3 Neuf Climatisé - Centre ville.", "latitude": 43.6132661, "longitude": 3.8783153},
{"name": "Artistic Loft, Downtown Montpellier, WIFI", "url": "https://www.booking.com/hotel/fr/artistic-loft-downtown-montpellier-wifi.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=7&hapos=7&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.2", "address": "8 Rue Guillaume Pellicier, 34070 Montpellier, France", "description": "Right in the centre of Montpellier, situated within a short distance of Montpellier National Opera and Montpellier Cathedral of Saint Peter, Artistic Loft, Downtown Montpellier, WIFI offers free WiFi, air conditioning and household amenities such as a toaster and coffee machine. This apartment features accommodation with a patio. The property is non-smoking and is set 1.4 km from Place de la Comédie.\n\nThe spacious apartment with a terrace and garden views has 1 bedroom, a living room, a flat-screen TV, an equipped kitchen with an oven and a microwave, and 1 bathroom with a walk-in shower. Towels and bed linen are available in the apartment. There is also a seating area and a fireplace.\n\nGuests can relax in the garden at the property.\n\nThe Corum is 1.7 km from the apartment, while Fabre Museum is 1.5 km from the property. The nearest airport is Montpellier - Mediterranee Airport, 10 km from Artistic Loft, Downtown Montpellier, WIFI.", "latitude": 43.6083263, "longitude": 3.8668426},
{"name": "Le temps d'un passage", "url": "https://www.booking.com/hotel/fr/le-temps-d-un-passage-montpellier.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=4&hapos=4&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.0", "address": "3 Passage Bruyas, 34000 Montpellier, France", "description": "In the heart of Montpellier, set within a short distance of Place de la Comédie and The Corum, Le temps d'un passage offers free WiFi, air conditioning and household amenities such as a dishwasher and coffee machine. Guests staying at this apartment have access to a patio. The property is non-smoking and is situated 2.2 km from Montpellier Town Hall.\n\nThe apartment is fitted with 1 bedroom, 1 bathroom, bed linen, towels, a flat-screen TV, a dining area, a fully equipped kitchen, and a balcony with city views. The unit at the property features a bath and a dressing room. For added privacy, the accommodation features a private entrance.\n\nPopular points of interest near the apartment include Fabre Museum, Montpellier National Opera and Montpellier Cathedral of Saint Peter. The nearest airport is Montpellier - Mediterranee Airport, 9 km from Le temps d'un passage.", "latitude": 43.6093775, "longitude": 3.8795106},
{"name": "Au cœur de M", "url": "https://www.booking.com/hotel/fr/au-coeur-de-m.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=3&hapos=3&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "9.8", "address": "8 Rue Baudin, 34000 Montpellier, France", "description": "Well located in the centre of Montpellier, Au cœur de M offers a balcony, air conditioning, free WiFi and flat-screen TV. The property features city views and is 400 metres from Montpellier National Opera and 700 metres from The Corum. The property is non-smoking and is located 2 km from Montpellier Town Hall.\n\nTowels and bed linen are provided in the bed and breakfast. For added privacy, the accommodation has a private entrance and soundproofing.\n\nA continental breakfast is available daily at the bed and breakfast. There is a coffee shop on-site.\n\nPopular points of interest near Au cœur de M include Fabre Museum, Place de la Comédie and Montpellier Cathedral of Saint Peter. The nearest airport is Montpellier - Mediterranee Airport, 9 km from the accommodation.", "latitude": 43.6083725, "longitude": 3.8817453},
{"name": "Joli studio avec terrasse-jardin sur les toits, coeur historique", "url": "https://www.booking.com/hotel/fr/joli-studio-avec-terrasse-coeur-historique.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=23&hapos=23&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from=searchresults", "rating": "8.5", "address": "4 eme etage 7 Rue des Teissiers, 34000 Montpellier, France", "description": "Located in the centre of Montpellier, just 700 metres from Montpellier Cathedral of Saint Peter and less than 1 km from The Corum, Joli studio avec terrasse-jardin sur les toits, coeur historique provides accommodation with city views and free WiFi. Guests staying at this apartment have access to a terrace. Outdoor dining is also possible at the apartment.\n\nThe apartment is equipped with 1 bedroom, a fully equipped kitchen with a microwave and a fridge, and 1 bathroom with a shower and a hair dryer. Towels and bed linen are provided in the apartment. This apartment is non-smoking and soundproof.\n\nPopular points of interest near Joli studio avec terrasse-jardin sur les toits, coeur historique include Fabre Museum, Place de la Comédie and Montpellier National Opera. The nearest airport is Montpellier - Mediterranee Airport, 11 km from the accommodation.", "latitude": 43.6086149, "longitude": 3.8755841},
{"name": "Hotel d'Aragon", "url": "https://www.booking.com/hotel/fr/hotel-daragon.en-gb.html?aid=304142&label=gen173nr-1FCAQoggJCEnNlYXJjaF9tb250cGVsbGllckgzWARoTYgBAZgBCbgBF8gBDNgBAegBAfgBA4gCAagCA7gCgeTGswbAAgHSAiRiYjU3ZGE3MS0yZjVmLTQ0ZTgtOGI0Mi1mMzk1Zjk1ODA1NzjYAgXgAgE&ucfs=1&arphpl=1&group_adults=2&req_adults=2&no_rooms=1&group_children=0&req_children=0&hpos=2&hapos=2&sr_order=popularity&srpvid=4b4d7200257000ad&srepoch=1718727170&from_sustainable_property_sr=1&from=searchresults", "rating": "8.6", "address": "10 rue Baudin, 34000 Montpellier, France", "description": "Situé au cœur de Montpellier, l'hôtel d'Aragon offre un cadre élégant et une situation privilégiée pour découvrir le patrimoine artistique, culturel et historique de la ville.\n\nLes chambres personnalisées de l'hôtel d'Aragon sont spacieuses, insonorisées et équipées d'une télévision à écran plat ( chromecast ), d'un accès Internet gratuit, pour certaines, de douches hydrojets, minibar, machine à café et d'une baignoire balnéo.\n\nPour le délicieux petit déjeuner nous privilégions des produits de qualités, des produits bio de préférence, sous forme de buffet qui est servi tous les jours dans la véranda au toit de verre, il devient un salon confortable baigné de lumière naturelle l'après midi pour un petit moment de convivialité.\n\nL'Hôtel d'Aragon bénéficie d'une situation privilégiée à 500 mètres de la gare TGV Saint Roch, à proximité de la place de la Comédie, de l'Opéra et du centre de conférences Corum.", "latitude": 43.60835743, "longitude": 3.88187259}
]